[Survived] ArrayDeclaration
static/js/sign/signature-canvas.js:3:16
 // Keep all variables at the top level so they are accessible
 let signaturePadCanvas, undoButton, redoButton, signaturePad;
-let undoData = [];
+let undoData = ["Stryker was here"];
 
 // This function will contain all the setup logic

[Killed] BlockStatement
static/js/sign/signature-canvas.js:18:52
     penColor: "black",
   });
 
-  signaturePad.addEventListener("endStroke", () => {
-    undoData = [];
-  });
+  signaturePad.addEventListener("endStroke", () => {});
 
   // Define the handler as a named function so we can remove it later
killedBy: Signature Canvas Undo/Redo Logic should not redo if there is no undo data
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: [{}, {}]

[NoCoverage] BlockStatement
static/js/sign/signature-canvas.js:23:36
   });
 
   // Define the handler as a named function so we can remove it later
-  const handleKeyDown = (event) => {
-    switch (true) {
-      case event.key === "z" && event.ctrlKey:
-        undoButton.click();
-        break;
-      case event.key === "y" && event.ctrlKey:
-        redoButton.click();
-        break;
-    }
-  };
+  const handleKeyDown = (event) => {};
 
   window.addEventListener("keydown", handleKeyDown);

[NoCoverage] BooleanLiteral
static/js/sign/signature-canvas.js:24:13
 
   // Define the handler as a named function so we can remove it later
   const handleKeyDown = (event) => {
-    switch (true) {
+    switch (false) {
       case event.key === "z" && event.ctrlKey:
         undoButton.click();

[NoCoverage] LogicalOperator
static/js/sign/signature-canvas.js:25:12
   // Define the handler as a named function so we can remove it later
   const handleKeyDown = (event) => {
     switch (true) {
-      case event.key === "z" && event.ctrlKey:
+      case event.key === "z" || event.ctrlKey:
         undoButton.click();
         break;

[NoCoverage] ConditionalExpression
static/js/sign/signature-canvas.js:25:7
   // Define the handler as a named function so we can remove it later
   const handleKeyDown = (event) => {
     switch (true) {
-      case event.key === "z" && event.ctrlKey:
-        undoButton.click();
-        break;
+      case event.key === "z" && event.ctrlKey:
       case event.key === "y" && event.ctrlKey:
         redoButton.click();

[NoCoverage] ConditionalExpression
static/js/sign/signature-canvas.js:28:12
       case event.key === "z" && event.ctrlKey:
         undoButton.click();
         break;
-      case event.key === "y" && event.ctrlKey:
+      case false:
         redoButton.click();
         break;

[NoCoverage] LogicalOperator
static/js/sign/signature-canvas.js:28:12
       case event.key === "z" && event.ctrlKey:
         undoButton.click();
         break;
-      case event.key === "y" && event.ctrlKey:
+      case event.key === "y" || event.ctrlKey:
         redoButton.click();
         break;

[NoCoverage] BlockStatement
static/js/sign/signature-canvas.js:37:41
   window.addEventListener("keydown", handleKeyDown);
 
   const debouncedResize = debounce(resizeCanvas, 200);
-  new IntersectionObserver((entries) => {
-    if (entries.some((entry) => entry.intersectionRatio > 0)) {
-      debouncedResize();
-    }
-  }).observe(signaturePadCanvas);
+  new IntersectionObserver((entries) => {}).observe(signaturePadCanvas);
 
   new ResizeObserver(debouncedResize).observe(signaturePadCanvas);

[NoCoverage] ConditionalExpression
static/js/sign/signature-canvas.js:38:9
 
   const debouncedResize = debounce(resizeCanvas, 200);
   new IntersectionObserver((entries) => {
-    if (entries.some((entry) => entry.intersectionRatio > 0)) {
+    if (true) {
       debouncedResize();
     }

[NoCoverage] ConditionalExpression
static/js/sign/signature-canvas.js:38:9
 
   const debouncedResize = debounce(resizeCanvas, 200);
   new IntersectionObserver((entries) => {
-    if (entries.some((entry) => entry.intersectionRatio > 0)) {
+    if (false) {
       debouncedResize();
     }

[Survived] BlockStatement
static/js/sign/signature-canvas.js:46:29
   new ResizeObserver(debouncedResize).observe(signaturePadCanvas);
 
   // Return a cleanup function for tests to use
-  return function cleanup() {
-    window.removeEventListener("keydown", handleKeyDown);
-  };
+  return function cleanup() {};
 }
 

[Survived] EqualityOperator
static/js/sign/signature-canvas.js:52:38
 }
 
 // Automatically call init in a browser environment
-if (typeof window !== "undefined" && typeof module === "undefined") {
+if (typeof window !== "undefined" && typeof module !== "undefined") {
   window.addEventListener("DOMContentLoaded", init);
 }

[NoCoverage] BlockStatement
static/js/sign/signature-canvas.js:52:69
 }
 
 // Automatically call init in a browser environment
-if (typeof window !== "undefined" && typeof module === "undefined") {
-  window.addEventListener("DOMContentLoaded", init);
-}
+if (typeof window !== "undefined" && typeof module === "undefined") {}
 
 function undoDraw() {

[Killed] BlockStatement
static/js/sign/signature-canvas.js:56:21
   window.addEventListener("DOMContentLoaded", init);
 }
 
-function undoDraw() {
-  const data = signaturePad.toData();
-  if (data && data.length > 0) {
-    const removed = data.pop();
-    undoData.push(removed);
-    signaturePad.fromData(data);
-  }
-}
+function undoDraw() {}
 
 function redoDraw() {
killedBy: Signature Canvas Undo/Redo Logic should undo a draw action
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: [{}]

Number of calls: 0

[Killed] EqualityOperator
static/js/sign/signature-canvas.js:58:15
 
 function undoDraw() {
   const data = signaturePad.toData();
-  if (data && data.length > 0) {
+  if (data && data.length <= 0) {
     const removed = data.pop();
     undoData.push(removed);
killedBy: Signature Canvas Undo/Redo Logic should undo a draw action
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: [{}]

Number of calls: 0

[Killed] BlockStatement
static/js/sign/signature-canvas.js:58:32
 
 function undoDraw() {
   const data = signaturePad.toData();
-  if (data && data.length > 0) {
-    const removed = data.pop();
-    undoData.push(removed);
-    signaturePad.fromData(data);
-  }
+  if (data && data.length > 0) {}
 }
 
killedBy: Signature Canvas Undo/Redo Logic should undo a draw action
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: [{}]

Number of calls: 0

[Survived] BlockStatement
static/js/sign/signature-canvas.js:65:21
   }
 }
 
-function redoDraw() {
-  if (undoData.length > 0) {
-    const data = signaturePad.toData();
-    data.push(undoData.pop());
-    signaturePad.fromData(data);
-  }
-}
+function redoDraw() {}
 
 function addDraggableFromPad() {

[Killed] EqualityOperator
static/js/sign/signature-canvas.js:66:7
 }
 
 function redoDraw() {
-  if (undoData.length > 0) {
+  if (undoData.length >= 0) {
     const data = signaturePad.toData();
     data.push(undoData.pop());
killedBy: Signature Canvas Undo/Redo Logic should not redo if there is no undo data
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: [{}, undefined]

[Killed] ConditionalExpression
static/js/sign/signature-canvas.js:66:7
 }
 
 function redoDraw() {
-  if (undoData.length > 0) {
+  if (true) {
     const data = signaturePad.toData();
     data.push(undoData.pop());
killedBy: Signature Canvas Undo/Redo Logic should not redo if there is no undo data
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: [{}, undefined]

[Killed] BlockStatement
static/js/sign/signature-canvas.js:73:32
   }
 }
 
-function addDraggableFromPad() {
-  if (signaturePad.isEmpty()) return;
-  const startTime = Date.now();
-  const croppedDataUrl = getCroppedCanvasDataUrl(signaturePadCanvas);
-  console.log(Date.now() - startTime);
-  DraggableUtils.createDraggableCanvasFromUrl(croppedDataUrl);
-}
+function addDraggableFromPad() {}
 
 function getCroppedCanvasDataUrl(canvas) {
killedBy: Signature Canvas Canvas and Image Utilities should add a draggable if pad is not empty
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
static/js/sign/signature-canvas.js:74:7
 }
 
 function addDraggableFromPad() {
-  if (signaturePad.isEmpty()) return;
+  if (true) return;
   const startTime = Date.now();
   const croppedDataUrl = getCroppedCanvasDataUrl(signaturePadCanvas);
killedBy: Signature Canvas Canvas and Image Utilities should add a draggable if pad is not empty
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Survived] ConditionalExpression
static/js/sign/signature-canvas.js:74:7
 }
 
 function addDraggableFromPad() {
-  if (signaturePad.isEmpty()) return;
+  if (false) return;
   const startTime = Date.now();
   const croppedDataUrl = getCroppedCanvasDataUrl(signaturePadCanvas);

[Survived] ArithmeticOperator
static/js/sign/signature-canvas.js:77:15
   if (signaturePad.isEmpty()) return;
   const startTime = Date.now();
   const croppedDataUrl = getCroppedCanvasDataUrl(signaturePadCanvas);
-  console.log(Date.now() - startTime);
+  console.log(Date.now() + startTime);
   DraggableUtils.createDraggableCanvasFromUrl(croppedDataUrl);
 }

[Survived] BooleanLiteral
static/js/sign/signature-canvas.js:82:67
 }
 
 function getCroppedCanvasDataUrl(canvas) {
-  let originalCtx = canvas.getContext("2d", { willReadFrequently: true });
+  let originalCtx = canvas.getContext("2d", { willReadFrequently: false });
   let originalWidth = canvas.width;
   let originalHeight = canvas.height;

[Killed] StringLiteral
static/js/sign/signature-canvas.js:82:39
 }
 
 function getCroppedCanvasDataUrl(canvas) {
-  let originalCtx = canvas.getContext("2d", { willReadFrequently: true });
+  let originalCtx = canvas.getContext("", { willReadFrequently: true });
   let originalWidth = canvas.width;
   let originalHeight = canvas.height;
killedBy: Signature Canvas Canvas and Image Utilities should add a draggable if pad is not empty
statusReason: TypeError: Cannot read properties of null (reading 'getImageData')

[Survived] ArithmeticOperator
static/js/sign/signature-canvas.js:87:14
   let originalHeight = canvas.height;
   let imageData = originalCtx.getImageData(0, 0, originalWidth, originalHeight);
 
-  let minX = originalWidth + 1,
+  let minX = originalWidth - 1,
     maxX = -1,
     minY = originalHeight + 1,

[Survived] UnaryOperator
static/js/sign/signature-canvas.js:88:12
   let imageData = originalCtx.getImageData(0, 0, originalWidth, originalHeight);
 
   let minX = originalWidth + 1,
-    maxX = -1,
+    maxX = +1,
     minY = originalHeight + 1,
     maxY = -1;

[Survived] ArithmeticOperator
static/js/sign/signature-canvas.js:89:12
 
   let minX = originalWidth + 1,
     maxX = -1,
-    minY = originalHeight + 1,
+    minY = originalHeight - 1,
     maxY = -1;
 

[Survived] UnaryOperator
static/js/sign/signature-canvas.js:90:12
   let minX = originalWidth + 1,
     maxX = -1,
     minY = originalHeight + 1,
-    maxY = -1;
+    maxY = +1;
 
   for (let y = 0; y < originalHeight; y++) {

[Killed] ConditionalExpression
static/js/sign/signature-canvas.js:92:19
     minY = originalHeight + 1,
     maxY = -1;
 
-  for (let y = 0; y < originalHeight; y++) {
+  for (let y = 0; false; y++) {
     for (let x = 0; x < originalWidth; x++) {
       let idx = (y * originalWidth + x) * 4;
killedBy: Signature Canvas Canvas and Image Utilities should return a data URL for a non-empty canvas
statusReason: Error: expect(received).toContain(expected) // indexOf

Matcher error: received value must not be null nor undefined

Received has value: null

[Killed] EqualityOperator
static/js/sign/signature-canvas.js:92:19
     minY = originalHeight + 1,
     maxY = -1;
 
-  for (let y = 0; y < originalHeight; y++) {
+  for (let y = 0; y >= originalHeight; y++) {
     for (let x = 0; x < originalWidth; x++) {
       let idx = (y * originalWidth + x) * 4;
killedBy: Signature Canvas Canvas and Image Utilities should return a data URL for a non-empty canvas
statusReason: Error: expect(received).toContain(expected) // indexOf

Matcher error: received value must not be null nor undefined

Received has value: null

[Killed] BlockStatement
static/js/sign/signature-canvas.js:93:45
     maxY = -1;
 
   for (let y = 0; y < originalHeight; y++) {
-    for (let x = 0; x < originalWidth; x++) {
-      let idx = (y * originalWidth + x) * 4;
-      let alpha = imageData.data[idx + 3];
-      if (alpha > 0) {
-        if (minX > x) minX = x;
-        if (maxX < x) maxX = x;
-        if (minY > y) minY = y;
-        if (maxY < y) maxY = y;
-      }
-    }
+    for (let x = 0; x < originalWidth; x++) {}
   }
 
killedBy: Signature Canvas Canvas and Image Utilities should return a data URL for a non-empty canvas
statusReason: Error: expect(received).toContain(expected) // indexOf

Matcher error: received value must not be null nor undefined

Received has value: null

[Killed] ConditionalExpression
static/js/sign/signature-canvas.js:93:21
     maxY = -1;
 
   for (let y = 0; y < originalHeight; y++) {
-    for (let x = 0; x < originalWidth; x++) {
+    for (let x = 0; false; x++) {
       let idx = (y * originalWidth + x) * 4;
       let alpha = imageData.data[idx + 3];
killedBy: Signature Canvas Canvas and Image Utilities should return a data URL for a non-empty canvas
statusReason: Error: expect(received).toContain(expected) // indexOf

Matcher error: received value must not be null nor undefined

Received has value: null

[Survived] ArithmeticOperator
static/js/sign/signature-canvas.js:94:18
 
   for (let y = 0; y < originalHeight; y++) {
     for (let x = 0; x < originalWidth; x++) {
-      let idx = (y * originalWidth + x) * 4;
+      let idx = (y / originalWidth + x) * 4;
       let alpha = imageData.data[idx + 3];
       if (alpha > 0) {

[Survived] ArithmeticOperator
static/js/sign/signature-canvas.js:94:18
 
   for (let y = 0; y < originalHeight; y++) {
     for (let x = 0; x < originalWidth; x++) {
-      let idx = (y * originalWidth + x) * 4;
+      let idx = (y * originalWidth - x) * 4;
       let alpha = imageData.data[idx + 3];
       if (alpha > 0) {

[Killed] ArithmeticOperator
static/js/sign/signature-canvas.js:95:34
   for (let y = 0; y < originalHeight; y++) {
     for (let x = 0; x < originalWidth; x++) {
       let idx = (y * originalWidth + x) * 4;
-      let alpha = imageData.data[idx + 3];
+      let alpha = imageData.data[idx - 3];
       if (alpha > 0) {
         if (minX > x) minX = x;
killedBy: Signature Canvas Canvas and Image Utilities should return a data URL for a non-empty canvas
statusReason: Error: expect(received).toContain(expected) // indexOf

Matcher error: received value must not be null nor undefined

Received has value: null

[Killed] BlockStatement
static/js/sign/signature-canvas.js:96:22
     for (let x = 0; x < originalWidth; x++) {
       let idx = (y * originalWidth + x) * 4;
       let alpha = imageData.data[idx + 3];
-      if (alpha > 0) {
-        if (minX > x) minX = x;
-        if (maxX < x) maxX = x;
-        if (minY > y) minY = y;
-        if (maxY < y) maxY = y;
-      }
+      if (alpha > 0) {}
     }
   }
killedBy: Signature Canvas Canvas and Image Utilities should return a data URL for a non-empty canvas
statusReason: Error: expect(received).toContain(expected) // indexOf

Matcher error: received value must not be null nor undefined

Received has value: null

[Killed] EqualityOperator
static/js/sign/signature-canvas.js:96:11
     for (let x = 0; x < originalWidth; x++) {
       let idx = (y * originalWidth + x) * 4;
       let alpha = imageData.data[idx + 3];
-      if (alpha > 0) {
+      if (alpha >= 0) {
         if (minX > x) minX = x;
         if (maxX < x) maxX = x;
killedBy: Signature Canvas Canvas and Image Utilities should return null for a completely empty canvas
statusReason: TypeError: croppedCtx.putImageData is not a function

[Killed] ConditionalExpression
static/js/sign/signature-canvas.js:97:13
       let idx = (y * originalWidth + x) * 4;
       let alpha = imageData.data[idx + 3];
       if (alpha > 0) {
-        if (minX > x) minX = x;
+        if (false) minX = x;
         if (maxX < x) maxX = x;
         if (minY > y) minY = y;
killedBy: Signature Canvas Canvas and Image Utilities should return a data URL for a non-empty canvas
statusReason: Error: expect(received).toContain(expected) // indexOf

Matcher error: received value must not be null nor undefined

Received has value: null

[Killed] EqualityOperator
static/js/sign/signature-canvas.js:97:13
       let idx = (y * originalWidth + x) * 4;
       let alpha = imageData.data[idx + 3];
       if (alpha > 0) {
-        if (minX > x) minX = x;
+        if (minX <= x) minX = x;
         if (maxX < x) maxX = x;
         if (minY > y) minY = y;
killedBy: Signature Canvas Canvas and Image Utilities should return a data URL for a non-empty canvas
statusReason: Error: expect(received).toContain(expected) // indexOf

Matcher error: received value must not be null nor undefined

Received has value: null

[Killed] ConditionalExpression
static/js/sign/signature-canvas.js:98:13
       let alpha = imageData.data[idx + 3];
       if (alpha > 0) {
         if (minX > x) minX = x;
-        if (maxX < x) maxX = x;
+        if (false) maxX = x;
         if (minY > y) minY = y;
         if (maxY < y) maxY = y;
killedBy: Signature Canvas Canvas and Image Utilities should return a data URL for a non-empty canvas
statusReason: Error: expect(received).toContain(expected) // indexOf

Matcher error: received value must not be null nor undefined

Received has value: null

[Killed] EqualityOperator
static/js/sign/signature-canvas.js:98:13
       let alpha = imageData.data[idx + 3];
       if (alpha > 0) {
         if (minX > x) minX = x;
-        if (maxX < x) maxX = x;
+        if (maxX >= x) maxX = x;
         if (minY > y) minY = y;
         if (maxY < y) maxY = y;
killedBy: Signature Canvas Canvas and Image Utilities should return a data URL for a non-empty canvas
statusReason: Error: expect(received).toContain(expected) // indexOf

Matcher error: received value must not be null nor undefined

Received has value: null

[Killed] ConditionalExpression
static/js/sign/signature-canvas.js:99:13
       if (alpha > 0) {
         if (minX > x) minX = x;
         if (maxX < x) maxX = x;
-        if (minY > y) minY = y;
+        if (false) minY = y;
         if (maxY < y) maxY = y;
       }
killedBy: Signature Canvas Canvas and Image Utilities should return a data URL for a non-empty canvas
statusReason: Error: expect(received).toContain(expected) // indexOf

Matcher error: received value must not be null nor undefined

Received has value: null

[Killed] EqualityOperator
static/js/sign/signature-canvas.js:99:13
       if (alpha > 0) {
         if (minX > x) minX = x;
         if (maxX < x) maxX = x;
-        if (minY > y) minY = y;
+        if (minY <= y) minY = y;
         if (maxY < y) maxY = y;
       }
killedBy: Signature Canvas Canvas and Image Utilities should return a data URL for a non-empty canvas
statusReason: Error: expect(received).toContain(expected) // indexOf

Matcher error: received value must not be null nor undefined

Received has value: null

[Killed] ConditionalExpression
static/js/sign/signature-canvas.js:100:13
         if (minX > x) minX = x;
         if (maxX < x) maxX = x;
         if (minY > y) minY = y;
-        if (maxY < y) maxY = y;
+        if (false) maxY = y;
       }
     }
killedBy: Signature Canvas Canvas and Image Utilities should return a data URL for a non-empty canvas
statusReason: Error: expect(received).toContain(expected) // indexOf

Matcher error: received value must not be null nor undefined

Received has value: null

[Killed] EqualityOperator
static/js/sign/signature-canvas.js:100:13
         if (minX > x) minX = x;
         if (maxX < x) maxX = x;
         if (minY > y) minY = y;
-        if (maxY < y) maxY = y;
+        if (maxY >= y) maxY = y;
       }
     }
killedBy: Signature Canvas Canvas and Image Utilities should return a data URL for a non-empty canvas
statusReason: Error: expect(received).toContain(expected) // indexOf

Matcher error: received value must not be null nor undefined

Received has value: null

[Survived] ArithmeticOperator
static/js/sign/signature-canvas.js:105:22
     }
   }
 
-  let croppedWidth = maxX - minX;
+  let croppedWidth = maxX + minX;
   let croppedHeight = maxY - minY;
   if (croppedWidth < 0 || croppedHeight < 0) return null;

[Survived] ArithmeticOperator
static/js/sign/signature-canvas.js:106:23
   }
 
   let croppedWidth = maxX - minX;
-  let croppedHeight = maxY - minY;
+  let croppedHeight = maxY + minY;
   if (croppedWidth < 0 || croppedHeight < 0) return null;
   let cutImageData = originalCtx.getImageData(minX, minY, croppedWidth, croppedHeight);

[Killed] ConditionalExpression
static/js/sign/signature-canvas.js:107:7
 
   let croppedWidth = maxX - minX;
   let croppedHeight = maxY - minY;
-  if (croppedWidth < 0 || croppedHeight < 0) return null;
+  if (false) return null;
   let cutImageData = originalCtx.getImageData(minX, minY, croppedWidth, croppedHeight);
 
killedBy: Signature Canvas Canvas and Image Utilities should return null for a completely empty canvas
statusReason: TypeError: croppedCtx.putImageData is not a function

[Killed] EqualityOperator
static/js/sign/signature-canvas.js:107:27
 
   let croppedWidth = maxX - minX;
   let croppedHeight = maxY - minY;
-  if (croppedWidth < 0 || croppedHeight < 0) return null;
+  if (croppedWidth < 0 || croppedHeight >= 0) return null;
   let cutImageData = originalCtx.getImageData(minX, minY, croppedWidth, croppedHeight);
 
killedBy: Signature Canvas Canvas and Image Utilities should return a data URL for a non-empty canvas
statusReason: Error: expect(received).toContain(expected) // indexOf

Matcher error: received value must not be null nor undefined

Received has value: null

[NoCoverage] BlockStatement
static/js/sign/signature-canvas.js:120:21
   return croppedCanvas.toDataURL();
 }
 
-function isMobile() {
-  const userAgentCheck = /Mobi|Android|iPhone|iPad|iPod|Windows Phone|Opera Mini/i.test(navigator.userAgent);
-  const viewportCheck = window.matchMedia("(max-width: 768px)").matches;
-  return userAgentCheck || viewportCheck;
-}
+function isMobile() {}
 
 function getDeviceScalingFactor() {

[NoCoverage] StringLiteral
static/js/sign/signature-canvas.js:122:43
 
 function isMobile() {
   const userAgentCheck = /Mobi|Android|iPhone|iPad|iPod|Windows Phone|Opera Mini/i.test(navigator.userAgent);
-  const viewportCheck = window.matchMedia("(max-width: 768px)").matches;
+  const viewportCheck = window.matchMedia("").matches;
   return userAgentCheck || viewportCheck;
 }

[NoCoverage] LogicalOperator
static/js/sign/signature-canvas.js:123:10
 function isMobile() {
   const userAgentCheck = /Mobi|Android|iPhone|iPad|iPod|Windows Phone|Opera Mini/i.test(navigator.userAgent);
   const viewportCheck = window.matchMedia("(max-width: 768px)").matches;
-  return userAgentCheck || viewportCheck;
+  return userAgentCheck && viewportCheck;
 }
 

[NoCoverage] ConditionalExpression
static/js/sign/signature-canvas.js:123:10
 function isMobile() {
   const userAgentCheck = /Mobi|Android|iPhone|iPad|iPod|Windows Phone|Opera Mini/i.test(navigator.userAgent);
   const viewportCheck = window.matchMedia("(max-width: 768px)").matches;
-  return userAgentCheck || viewportCheck;
+  return false;
 }
 

[NoCoverage] BlockStatement
static/js/sign/signature-canvas.js:126:35
   return userAgentCheck || viewportCheck;
 }
 
-function getDeviceScalingFactor() {
-  return isMobile() ? 3 : 10;
-}
+function getDeviceScalingFactor() {}
 
 function resizeCanvas() {

[NoCoverage] BlockStatement
static/js/sign/signature-canvas.js:130:25
   return isMobile() ? 3 : 10;
 }
 
-function resizeCanvas() {
-  const ratio = Math.max(window.devicePixelRatio || 1, 1);
-  const additionalFactor = getDeviceScalingFactor();
-
-  signaturePadCanvas.width = signaturePadCanvas.offsetWidth * ratio * additionalFactor;
-  signaturePadCanvas.height = signaturePadCanvas.offsetHeight * ratio * additionalFactor;
-  signaturePadCanvas.getContext("2d").scale(ratio * additionalFactor, ratio * additionalFactor);
-
-  signaturePad.clear();
-}
+function resizeCanvas() {}
 
 const debounce = (fn, delay = 100) => {

[NoCoverage] ConditionalExpression
static/js/sign/signature-canvas.js:131:26
 }
 
 function resizeCanvas() {
-  const ratio = Math.max(window.devicePixelRatio || 1, 1);
+  const ratio = Math.max(true, 1);
   const additionalFactor = getDeviceScalingFactor();
 

[NoCoverage] ConditionalExpression
static/js/sign/signature-canvas.js:131:26
 }
 
 function resizeCanvas() {
-  const ratio = Math.max(window.devicePixelRatio || 1, 1);
+  const ratio = Math.max(false, 1);
   const additionalFactor = getDeviceScalingFactor();
 

[NoCoverage] ArithmeticOperator
static/js/sign/signature-canvas.js:134:30
   const ratio = Math.max(window.devicePixelRatio || 1, 1);
   const additionalFactor = getDeviceScalingFactor();
 
-  signaturePadCanvas.width = signaturePadCanvas.offsetWidth * ratio * additionalFactor;
+  signaturePadCanvas.width = signaturePadCanvas.offsetWidth / ratio * additionalFactor;
   signaturePadCanvas.height = signaturePadCanvas.offsetHeight * ratio * additionalFactor;
   signaturePadCanvas.getContext("2d").scale(ratio * additionalFactor, ratio * additionalFactor);

[NoCoverage] ArithmeticOperator
static/js/sign/signature-canvas.js:134:30
   const ratio = Math.max(window.devicePixelRatio || 1, 1);
   const additionalFactor = getDeviceScalingFactor();
 
-  signaturePadCanvas.width = signaturePadCanvas.offsetWidth * ratio * additionalFactor;
+  signaturePadCanvas.width = signaturePadCanvas.offsetWidth * ratio / additionalFactor;
   signaturePadCanvas.height = signaturePadCanvas.offsetHeight * ratio * additionalFactor;
   signaturePadCanvas.getContext("2d").scale(ratio * additionalFactor, ratio * additionalFactor);

[NoCoverage] ArithmeticOperator
static/js/sign/signature-canvas.js:135:31
   const additionalFactor = getDeviceScalingFactor();
 
   signaturePadCanvas.width = signaturePadCanvas.offsetWidth * ratio * additionalFactor;
-  signaturePadCanvas.height = signaturePadCanvas.offsetHeight * ratio * additionalFactor;
+  signaturePadCanvas.height = signaturePadCanvas.offsetHeight * ratio / additionalFactor;
   signaturePadCanvas.getContext("2d").scale(ratio * additionalFactor, ratio * additionalFactor);
 

[NoCoverage] ArithmeticOperator
static/js/sign/signature-canvas.js:135:31
   const additionalFactor = getDeviceScalingFactor();
 
   signaturePadCanvas.width = signaturePadCanvas.offsetWidth * ratio * additionalFactor;
-  signaturePadCanvas.height = signaturePadCanvas.offsetHeight * ratio * additionalFactor;
+  signaturePadCanvas.height = signaturePadCanvas.offsetHeight / ratio * additionalFactor;
   signaturePadCanvas.getContext("2d").scale(ratio * additionalFactor, ratio * additionalFactor);
 

[NoCoverage] ArithmeticOperator
static/js/sign/signature-canvas.js:136:45
 
   signaturePadCanvas.width = signaturePadCanvas.offsetWidth * ratio * additionalFactor;
   signaturePadCanvas.height = signaturePadCanvas.offsetHeight * ratio * additionalFactor;
-  signaturePadCanvas.getContext("2d").scale(ratio * additionalFactor, ratio * additionalFactor);
+  signaturePadCanvas.getContext("2d").scale(ratio / additionalFactor, ratio * additionalFactor);
 
   signaturePad.clear();

[NoCoverage] ArithmeticOperator
static/js/sign/signature-canvas.js:136:71
 
   signaturePadCanvas.width = signaturePadCanvas.offsetWidth * ratio * additionalFactor;
   signaturePadCanvas.height = signaturePadCanvas.offsetHeight * ratio * additionalFactor;
-  signaturePadCanvas.getContext("2d").scale(ratio * additionalFactor, ratio * additionalFactor);
+  signaturePadCanvas.getContext("2d").scale(ratio * additionalFactor, ratio / additionalFactor);
 
   signaturePad.clear();

[Survived] BlockStatement
static/js/sign/signature-canvas.js:141:39
   signaturePad.clear();
 }
 
-const debounce = (fn, delay = 100) => {
-  let timer;
-  return (...args) => {
-    clearTimeout(timer);
-    timer = setTimeout(() => fn(...args), delay);
-  };
-};
+const debounce = (fn, delay = 100) => {};
 
 // Add init to the exports for testing

[NoCoverage] BlockStatement
static/js/sign/signature-canvas.js:143:23
 
 const debounce = (fn, delay = 100) => {
   let timer;
-  return (...args) => {
-    clearTimeout(timer);
-    timer = setTimeout(() => fn(...args), delay);
-  };
+  return (...args) => {};
 };
 

[NoCoverage] ArrowFunction
static/js/sign/signature-canvas.js:145:24
   let timer;
   return (...args) => {
     clearTimeout(timer);
-    timer = setTimeout(() => fn(...args), delay);
+    timer = setTimeout(() => undefined, delay);
   };
 };

[Killed] BlockStatement
static/js/sign/signature-canvas.js:150:54
 };
 
 // Add init to the exports for testing
-if (typeof module !== "undefined" && module.exports) {
-  module.exports = {
-    init, // <-- Export init
-    undoDraw,
-    redoDraw,
-    addDraggableFromPad,
-    getCroppedCanvasDataUrl,
-    isMobile,
-    getDeviceScalingFactor,
-    resizeCanvas,
-    debounce,
-  };
-}
+if (typeof module !== "undefined" && module.exports) {}
 
killedBy: Signature Canvas Undo/Redo Logic should undo a draw action
statusReason: TypeError: init is not a function
