[Killed] ConditionalExpression
static/js/sign/signature-canvas.js:150:5
 };
 
 // Add init to the exports for testing
-if (typeof module !== "undefined" && module.exports) {
+if (false) {
   module.exports = {
     init, // <-- Export init
killedBy: Signature Canvas Undo/Redo Logic should undo a draw action
statusReason: TypeError: init is not a function

[Killed] ObjectLiteral
static/js/sign/signature-canvas.js:151:20
 
 // Add init to the exports for testing
 if (typeof module !== "undefined" && module.exports) {
-  module.exports = {
-    init, // <-- Export init
-    undoDraw,
-    redoDraw,
-    addDraggableFromPad,
-    getCroppedCanvasDataUrl,
-    isMobile,
-    getDeviceScalingFactor,
-    resizeCanvas,
-    debounce,
-  };
+  module.exports = {};
 }
 
killedBy: Signature Canvas Undo/Redo Logic should undo a draw action
statusReason: TypeError: init is not a function
